/*************************************************************************
	> File Name: 113.c
	> Author: 
	> Mail: 
	> Created Time: 2019年07月24日 星期三 08时48分40秒
 ************************************************************************/

#include<stdio.h>
int main()
{
int y,m,d;
    scanf("%d%d",&y,&m);
    if (m<=12)
    {
    if (m == 1 || m == 3 || m == 5 || m==7 ||m== 8 ||m==10||m==12)
        {
        printf("31");
        
        }
        else 
        {
        if (m!=2)
            {
            printf("30");
            }
            else
            {
            if(y%100 != 0 &&  y%4 == 0 || y%400 ==0)
                {
                printf("29");
                }
                else
                {
                printf("28");
                }
            
            }
        
        
        }
    
    }

return 0;

}
